БПКР/src/InformationRegisters/НормыБольничныхЛистов/НормыБольничныхЛистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыБольничныхЛистов</name>
  <resources>
    <name>ДнейОрганизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентБеременность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РазмерЗаСчетСФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РазмерБеременностьЗаСчетСФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НижняяГраница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/InformationRegisters/НормыБольничныхЛистов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Заполнить по умолчанию
// Выполняет первоночальное заполнение
Процедура ЗаполнитьПоУмолчанию() Экспорт 
	КлассификаторXML = РегистрыСведений.НормыБольничныхЛистов.ПолучитьМакет("МакетЗаполнения").ПолучитьТекст();
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	НаборЗаписей = РегистрыСведений.НормыБольничныхЛистов.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();                 
	
	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.НижняяГраница = Число(СокрЛП(СтрокаТаблицыЗначений.НижняяГраница));
		НоваяЗапись.ДнейОрганизации = Число(СокрЛП(СтрокаТаблицыЗначений.ДнейОрганизации));
		НоваяЗапись.Процент = Число(СокрЛП(СтрокаТаблицыЗначений.Процент));
		НоваяЗапись.ПроцентБеременность = Число(СокрЛП(СтрокаТаблицыЗначений.ПроцентБеременность));
		НоваяЗапись.РазмерЗаСчетСФ = Число(СокрЛП(СтрокаТаблицыЗначений.РазмерЗаСчетСФ));
		НоваяЗапись.РазмерБеременностьЗаСчетСФ = Число(СокрЛП(СтрокаТаблицыЗначений.РазмерБеременностьЗаСчетСФ));
	КонецЦикла;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
	КонецПопытки;
КонецПроцедуры // ЗаполнитьПоУмолчанию()	

#КонецОбласти

#КонецЕсли
